# questions.py

questions = [
    {
        "question_text": "האם בעקבות ההכשרה בתוכנית, גדל רצונך לעסוק בהייטק בעתיד?",
        "options": ['כן', 'לא', 'לא בטוח/ה']
    },
    {
        "question_text": "באיזו מידה התוכנית סיפקה לך הבנה טובה יותר על תחומי העבודה בהייטק?",
        "options": ['במידה רבה מאוד', 'במידה רבה', 'במידה בינונית', 'במידה מעטה', 'בכלל לא']
    },
    {
        "question_text": "האם את/ה מרגיש/ה שהתוכנית הכינה אותך בצורה טובה יותר ללימודי המשך בתחומים טכנולוגיים?",
        "options": ['כן, בהחלט', 'כן, חלקית', 'לא ממש', 'בכלל לא']
    },
    {
        "question_text": "עד כמה היית ממליץ/ה לתלמידים אחרים להשתתף בתוכנית זו כדי להתקרב לעולם ההייטק?",
        "options": ['מאוד ממליץ/ה', 'ממליץ/ה', 'לא ממליץ/ה במיוחד', 'בכלל לא ממליץ/ה']
    },
    {
        "question_text": "האם התוכנית גרמה לך לשקול התמחות או עבודה בתחום טכנולוגי במהלך או לאחר סיום לימודיך?",
        "options": ['כן', 'לא', 'עדיין לא החלטתי']
    }
]

